/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50617
Source Host           : localhost:3306
Source Database       : darkgod

Target Server Type    : MYSQL
Target Server Version : 50617
File Encoding         : 65001

Date: 2022-05-11 02:30:28
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for account
-- ----------------------------
DROP TABLE IF EXISTS `account`;
CREATE TABLE `account` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `acct` varchar(255) NOT NULL,
  `pass` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `lv` int(11) NOT NULL,
  `exp` int(11) NOT NULL,
  `power` int(11) NOT NULL,
  `coin` int(11) NOT NULL,
  `diamond` int(11) NOT NULL,
  `hp` int(11) NOT NULL COMMENT '血量',
  `ad` int(11) NOT NULL COMMENT '攻击',
  `ap` int(11) NOT NULL COMMENT '防御',
  `addef` int(11) NOT NULL,
  `apdef` int(11) NOT NULL,
  `dodge` int(11) NOT NULL COMMENT '闪避',
  `pierce` int(11) NOT NULL COMMENT '破甲率',
  `critical` int(11) NOT NULL COMMENT '暴击率',
  `guideid` int(11) NOT NULL COMMENT '任务id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=34 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of account
-- ----------------------------
INSERT INTO `account` VALUES ('3', '12', '12132', '华纱', '1', '0', '150', '5000', '500', '0', '0', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `account` VALUES ('4', '11', '12132', '闻人媗', '1', '0', '150', '5000', '500', '0', '0', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `account` VALUES ('5', '1234', '12132', '孔盼', '1', '0', '150', '5000', '500', '0', '0', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `account` VALUES ('6', '12341', '12132', '', '1', '0', '150', '5000', '500', '0', '0', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `account` VALUES ('7', '167', '12132', '', '1', '0', '150', '5000', '500', '0', '0', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `account` VALUES ('8', '121323124', '12132', '', '1', '0', '150', '5000', '500', '0', '0', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `account` VALUES ('9', '123', '12123', '游珍', '5', '300', '150', '5000', '500', '100', '9', '9', '1', '1', '1', '1', '1', '0');
INSERT INTO `account` VALUES ('10', '456', '12123', '白冰', '1', '0', '150', '5000', '500', '0', '0', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `account` VALUES ('11', '4566', '12123', '', '1', '0', '150', '5000', '500', '0', '0', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `account` VALUES ('12', '478', '12123', '', '1', '0', '150', '5000', '500', '0', '0', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `account` VALUES ('13', '908', '12123', '许盈', '1', '0', '150', '5000', '500', '0', '0', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `account` VALUES ('14', '654', '12123', '', '1', '0', '150', '5000', '500', '0', '0', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `account` VALUES ('15', '876', '12123', '', '1', '0', '150', '5000', '500', '0', '0', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `account` VALUES ('16', '432', '12123', '', '1', '0', '150', '5000', '500', '0', '0', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `account` VALUES ('17', '4321', '12123', '', '1', '0', '150', '5000', '500', '0', '0', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `account` VALUES ('18', '65543', '12123', '', '1', '0', '150', '5000', '500', '0', '0', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `account` VALUES ('19', '3456', '12123', '', '1', '0', '150', '5000', '500', '0', '0', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `account` VALUES ('20', '345611', '12123', '', '1', '0', '150', '5000', '500', '0', '0', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `account` VALUES ('21', '3456111', '12123', '', '1', '0', '150', '5000', '500', '0', '0', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `account` VALUES ('22', '345611188', '12123', '', '1', '0', '150', '5000', '500', '0', '0', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `account` VALUES ('23', 'sa', '12123', '', '1', '0', '150', '5000', '500', '0', '275', '265', '67', '43', '7', '5', '2', '0');
INSERT INTO `account` VALUES ('24', 'asa', '12123', '', '1', '0', '150', '5000', '500', '0', '275', '265', '67', '43', '7', '5', '2', '0');
INSERT INTO `account` VALUES ('25', 'sdfsdf', '12123', '', '1', '0', '150', '5000', '500', '0', '275', '265', '67', '43', '7', '5', '2', '0');
INSERT INTO `account` VALUES ('26', 'asdas', '12123', '宁纹', '1', '0', '150', '5000', '500', '0', '275', '265', '67', '43', '7', '5', '2', '0');
INSERT INTO `account` VALUES ('27', '231', '12123', '宋怜', '1', '0', '150', '5000', '500', '0', '275', '265', '67', '43', '7', '5', '2', '0');
INSERT INTO `account` VALUES ('28', '444', '12123', '宇文璃', '1', '0', '150', '5000', '500', '0', '275', '265', '67', '43', '7', '5', '2', '0');
INSERT INTO `account` VALUES ('29', '122', '12123', '安露', '1', '0', '150', '5000', '500', '0', '275', '265', '67', '43', '7', '5', '2', '0');
INSERT INTO `account` VALUES ('30', '1221', '12123', '百里宁', '1', '0', '150', '5000', '500', '0', '275', '265', '67', '43', '7', '5', '2', '0');
INSERT INTO `account` VALUES ('31', '222', '12123', '黄伊', '1', '0', '150', '5000', '500', '0', '275', '265', '67', '43', '7', '5', '2', '0');
INSERT INTO `account` VALUES ('32', '567', '12123', '陈遥', '1', '0', '150', '5000', '500', '0', '275', '265', '67', '43', '7', '5', '2', '0');
INSERT INTO `account` VALUES ('33', '999', '12123', '卢灵', '1', '0', '150', '5000', '500', '0', '275', '265', '67', '43', '7', '5', '2', '1001');
