/****************************************************
    文件：ExtendMath.Algebra.Advanced.Polynomia.cs
	作者：lenovo
    邮箱: 
    日期：2024/5/21 13:50:37
	功能： 多项式代数
*****************************************************/

using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using Random = UnityEngine.Random;
 
public static partial class ExtendPolynomiaAlgebra 
{
    //定义
    //在数学中，几个单项式的和（或者差），叫做多项式 。
    //多项式中的每个单项式叫做多项式的项，这些单项式中的最高项次数，就是这个多项式的次数。
    //其中多项式中不含字母的项叫做常数项。
    //研究整除性理论、最大公因式、重因式。
    //
    //应用
    //函数及其根
    //插值多项式
    //
    //定理
    //高斯引理
    //分解定理
    //
    //运算法则
    //加法与乘法
    //带余除法
    //辗转相除法


    // 沿着这两个方向继续发展，代数在讨论任意多个未知数的一次方程组，同时还研究次数更高的一元方程。
    // 发展到这个阶段，就叫做高等代数。高等代数是代数学发展到高级阶段的总称，它包括许多分支。
}



