/****************************************************
    文件：ExtendMath.Ism.cs
	作者：lenovo
    邮箱: 
    日期：2024/5/21 14:43:38
	功能：数学中的主义
*****************************************************/

using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using Random = UnityEngine.Random;
 

public static partial class ExtendMathIsm 
{
    /// <summary>数学中的主义</summary>
    public enum EMathIsm
    {
        /// <summary>逻辑主义</summary>
        Logicism   ,
        数学基础  ,
            数理逻辑
    }
    //主张数学是逻辑的延伸。
    //他们只研究概念间的纯逻辑关系，从逻辑学可推导出全部数学，全部数学可以归结为逻辑学。
    //
    //
    //其代表人物是弗雷格、罗素、怀特海。
    //弗雷格相信全部数学都能从基本的逻辑规律推演出来，认为集合论具有逻辑的性质。
    //他发明了一套无论在当时还是现在都使人觉得难以理解的逻辑符号，并把集合论的某些内容翻译和再造成逻辑学的定义和定理，进而定义了自然数和推演出整个算术理论。
    //
    //著名的罗素悖论使弗雷格把数学建立在集合论之上的想法，遭到严重的打击。但是逻辑主义并未中断。
    //罗素继承了弗雷格的思想，为了解决由集合论危机引起的数学基础危机，提出了从逻辑概念推出数学概念，从逻辑公理推出数学定理，从而推导出全部数学的计划。
    //
    //罗素在1903年出版的《数学的原理》中对于数学的本性发表了自己的见解。他说：“纯粹数学是所有形如‘p蕴涵q’的所有命题类，其中p和q都包含数目相同的一个或多个变元的命题，且p和q除了逻辑常项之外，不包含任何常项。所谓逻辑常项是可由下面这些对象定义的概念：蕴涵，一个项与它所属类的关系，如此这般的概念，关系的概念，以及象涉及上述形式一般命题概念的其他概念。除此之外，数学使用一个不是它所考虑的命题组成部分的概念，即真假的概念。”
//这种看法是罗素自己最早发表的关于逻辑主义的论点。这种看法在以前也不同程度被戴德金、弗雷格、皮亚诺、怀特海等人表达过。戴德金在1872年出版了《连续性及无理数》一文，在这篇文章中，他把有理数做为已知，进而分析连续性这个概念。为了要彻底解决这个问题，必须考虑有理数乃至自然数产生的问题。他认为应该建立在逻辑基础上，但没有实行。

}



